# Using Pandas

**pandas** is a data analytics framework written in Python that provides a fast and flexible way to express tabular (relational) data that would normally be done using a Spreadsheet application.

It aims to be a high-level building block for performing data analysis in Python.

**pandas** can read the following data formats:
  - Tabular data (RDBMS table,  Excel spreadsheet, CSV file, Tabbed text file, HTML tables)
  - Ordered/unordered time series data (Logs which are properly formatted)
  - Numpy arrays and similar array-like objects (2-D matrix)

### Pandas fundamental data structures
- Series (1-dimensional) 
- DataFrame (2-dimensional - made up of Series)

Series objects are array-like and can be used in environments that expect numpy arrays

In [1]:
%pylab inline

import pandas as pd

Populating the interactive namespace from numpy and matplotlib

## Loading data into pandas

In [5]:
cat scores.csv

name,physics,maths,compsci
john,66,78,89
adrian,82,73,91
bourne,73,94,86
smith,62,65,68
jane,79,84,89
david,84,87,82
emily,80,93,84
floyd,87,86,92
gary,78,72,84

In [30]:
df = pd.read_csv("scores.csv")
#df = pd.read_excel("scores.xlsx", "sheet1")
#df  = pd.read_html("html_tables.html")
#df = pd.DataFrame()
df

     name  physics  maths  compsci
0    john       66     78       89
1  adrian       82     73       91
2  bourne       73     94       86
3   smith       62     65       68
4    jane       79     84       89
5   david       84     87       82
6   emily       80     93       84
7   floyd       87     86       92
8    gary       78     72       84

In [7]:
data = [
 {'name': 'john',   'physics': 66, 'maths': 78, 'compsci': 89 },
 {'name': 'adrian', 'physics': 82, 'maths': 73, 'compsci': 91 },
 {'name': 'bourne', 'physics': 73, 'maths': 94, 'compsci': 86 },
 {'name': 'smith',  'physics': 62, 'maths': 65, 'compsci': 68 },
 {'name': 'jane',   'physics': 79, 'maths': 84, 'compsci': 89 },
 {'name': 'david',  'physics': 84, 'maths': 87, 'compsci': 82 },
 {'name': 'emily',  'physics': 80, 'maths': 93, 'compsci': 84 },
 {'name': 'floyd',  'physics': 87, 'maths': 86, 'compsci': 92 },
 {'name': 'gary',   'physics': 78, 'maths': 72, 'compsci': 84 }]

df = pd.DataFrame(data)
df

   compsci  maths    name  physics
0       89     78    john       66
1       91     73  adrian       82
2       86     94  bourne       73
3       68     65   smith       62
4       89     84    jane       79
5       82     87   david       84
6       84     93   emily       80
7       92     86   floyd       87
8       84     72    gary       78

In [8]:
from collections import OrderedDict

data = [
 OrderedDict([('name', 'john'),
              ('physics', '66'),
              ('maths', '78'),
              ('compsci', '89')]),
 OrderedDict([('name', 'adrian'),
              ('physics', '82'),
              ('maths', '73'),
              ('compsci', '91')]),
 OrderedDict([('name', 'bourne'),
              ('physics', '73'),
              ('maths', '94'),
              ('compsci', '86')]),
 OrderedDict([('name', 'smith'),
              ('physics', '62'),
              ('maths', '65'),
              ('compsci', '68')]),
 OrderedDict([('name', 'jane'),
              ('physics', '79'),
              ('maths', '84'),
              ('compsci', '89')]),
 OrderedDict([('name', 'david'),
              ('physics', '84'),
              ('maths', '87'),
              ('compsci', '82')]),
 OrderedDict([('name', 'emily'),
              ('physics', '80'),
              ('maths', '93'),
              ('compsci', '84')]),
 OrderedDict([('name', 'floyd'),
              ('physics', '87'),
              ('maths', '86'),
              ('compsci', '92')]),
 OrderedDict([('name', 'gary'),
              ('physics', '78'),
              ('maths', '72'),
              ('compsci', '84')])]

df = pd.DataFrame(data)
df

     name physics maths compsci
0    john      66    78      89
1  adrian      82    73      91
2  bourne      73    94      86
3   smith      62    65      68
4    jane      79    84      89
5   david      84    87      82
6   emily      80    93      84
7   floyd      87    86      92
8    gary      78    72      84

In [9]:
data = {
    'name': ['john', 'adrian', 'bourne', 'smith', 'jane', 'david', 'emily', 'floyd', 'gary'],
    'physics': [66, 82, 73, 62, 79, 84, 80, 87, 78],
    'maths': [78, 73, 94, 65, 84, 87, 93, 86, 72],
    'compsci': [89, 91, 86, 68, 89, 82, 84, 92, 84]
}

df = pd.DataFrame(data)
df

     name  physics  maths  compsci
0    john       66     78       89
1  adrian       82     73       91
2  bourne       73     94       86
3   smith       62     65       68
4    jane       79     84       89
5   david       84     87       82
6   emily       80     93       84
7   floyd       87     86       92
8    gary       78     72       84

In [10]:
data = {
    'name': ['john', 'adrian', 'bourne', 'smith', 'jane', 'david', 'emily', 'floyd', 'gary'],
    'physics': [66, 82, 73, 62, 79, 84, 80, 87, 78],
    'maths': [78, 73, 94, 65, 84, 87, 93, 86, 72],
    'compsci': [89, 91, 86, 68, 89, 82, 84, 92, 84]
}

df = pd.DataFrame(data)
df.to_excel("scores.xlsx")

In [31]:
data = {
    'name': ['john', 'adrian', 'bourne', 'smith', 'jane', 'david', 'emily', 'floyd', 'gary'],
    'physics': [66, 82, 73, 62, 79, 84, 80, 87, 78],
    'maths': [78, 73, 94, 65, 84, 87, 93, 86, 72],
    'compsci': [89, 91, 86, 68, 89, 82, 84, 92, 84]
}

df = pd.DataFrame(data)
df["name"] = df["name"].apply(lambda x: x.upper())
df

     name  physics  maths  compsci
0    JOHN       66     78       89
1  ADRIAN       82     73       91
2  BOURNE       73     94       86
3   SMITH       62     65       68
4    JANE       79     84       89
5   DAVID       84     87       82
6   EMILY       80     93       84
7   FLOYD       87     86       92
8    GARY       78     72       84

In [12]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [13]:
df[:4][["name", "physics"]]

     name  physics
0    JOHN       66
1  ADRIAN       82
2  BOURNE       73
3   SMITH       62

In [14]:
df["physics"].max()

87

In [15]:
df[["name", "maths"]]

     name  maths
0    JOHN     78
1  ADRIAN     73
2  BOURNE     94
3   SMITH     65
4    JANE     84
5   DAVID     87
6   EMILY     93
7   FLOYD     86
8    GARY     72

In [16]:
df[:4]["name"]

0      JOHN
1    ADRIAN
2    BOURNE
3     SMITH
Name: name, dtype: object

In [17]:
df.maths

0    78
1    73
2    94
3    65
4    84
5    87
6    93
7    86
8    72
Name: maths, dtype: int64

In [18]:
df.columns

Index(['name', 'physics', 'maths', 'compsci'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [20]:
df.maths.max()

94

In [21]:
df[df["maths"] == df["maths"].max()]

     name  physics  maths  compsci
2  BOURNE       73     94       86

In [22]:
df["name"][df["maths"] == df["maths"].max()]

2    BOURNE
Name: name, dtype: object

In [24]:
df[df["maths"] == df["maths"].max()]["name"]

2    BOURNE
Name: name, dtype: object

In [32]:
df["name"]

0      JOHN
1    ADRIAN
2    BOURNE
3     SMITH
4      JANE
5     DAVID
6     EMILY
7     FLOYD
8      GARY
Name: name, dtype: object

In [33]:
df.set_index("name", inplace=True)
#df.reset_index()
df

        physics  maths  compsci
name
JOHN         66     78       89
ADRIAN       82     73       91
BOURNE       73     94       86
SMITH        62     65       68
JANE         79     84       89
DAVID        84     87       82
EMILY        80     93       84
FLOYD        87     86       92
GARY         78     72       84

In [35]:
df.index

Index(['JOHN', 'ADRIAN', 'BOURNE', 'SMITH', 'JANE', 'DAVID', 'EMILY', 'FLOYD',
       'GARY'],
      dtype='object', name='name')

In [36]:
df.index[:1]

Index(['JOHN'], dtype='object', name='name')

In [39]:
df.reset_index(inplace=True)

In [40]:
df

     name  physics  maths  compsci
0    JOHN       66     78       89
1  ADRIAN       82     73       91
2  BOURNE       73     94       86
3   SMITH       62     65       68
4    JANE       79     84       89
5   DAVID       84     87       82
6   EMILY       80     93       84
7   FLOYD       87     86       92
8    GARY       78     72       84

In [41]:
df["name"][df["compsci"] > 85].count()

5

In [46]:
pt = df.pivot_table(columns=["name"])
pt

name     ADRIAN  BOURNE  DAVID  EMILY  FLOYD  GARY  JANE  JOHN  SMITH
compsci      91      86     82     84     92    84    89    89     68
maths        73      94     87     93     86    72    84    78     65
physics      82      73     84     80     87    78    79    66     62

In [49]:
df.pivot(index="physics", columns="maths", values=["name"])

          name
maths       65    72      73    78    84     86     87     93      94
physics
62       SMITH   NaN     NaN   NaN   NaN    NaN    NaN    NaN     NaN
66         NaN   NaN     NaN  JOHN   NaN    NaN    NaN    NaN     NaN
73         NaN   NaN     NaN   NaN   NaN    NaN    NaN    NaN  BOURNE
78         NaN  GARY     NaN   NaN   NaN    NaN    NaN    NaN     NaN
79         NaN   NaN     NaN   NaN  JANE    NaN    NaN    NaN     NaN
80         NaN   NaN     NaN   NaN   NaN    NaN    NaN  EMILY     NaN
82         NaN   NaN  ADRIAN   NaN   NaN    NaN    NaN    NaN     NaN
84         NaN   NaN     NaN   NaN   NaN    NaN  DAVID    NaN     NaN
87         NaN   NaN     NaN   NaN   NaN  FLOYD    NaN    NaN     NaN

In [50]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})

df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [51]:
table = df.pivot_table(values='D', index=['A', 'B'],  columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [123]:
import re

line1 = '            bash-2888  [002] ....   214.858474: kmem_cache_free: call_site=c132e814 ptr=d78dd0a0\n'
line2 = '            bash-2833  [001] ....   214.858888: kmalloc: call_site=c13a0a0d ptr=d5265780 bytes_req=188 bytes_alloc=192 gfp_flags=GFP_KERNEL_ACCOUNT|__GFP_ZERO\n'

generic_regex = r"""
    (?P<program>\S+)
    -
    (?P<pid>\d+)
    \s+\[
    (?P<cpu>\d+)
    \]\s+
    (?P<irqs_disabled>.)
    (?P<need_resched>.)
    (?P<irq_context>.)
    (?P<preempt_count>.)
    \s+
    (?P<timestamp>[\d\.]+)
    :\s+
    (?P<function>\w+)
    :\s+.+
"""

alloc_regex = r"""
    bytes_req=(?P<bytes_req>\d+)
    \s+
    bytes_alloc=(?P<bytes_alloc>\d+)
"""
gpattern = re.compile(generic_regex, re.VERBOSE)
alloc_pattern = re.compile(alloc_regex, re.VERBOSE)

from collections import OrderedDict


def parse_trace_log(filename):
    with open(filename) as tracefile:
        for line in tracefile:
            generic = gpattern.search(line)
            if not generic: continue
            rec = OrderedDict(generic.groupdict())
            alloc = alloc_pattern.search(line)
            if alloc:
                rec.update(alloc.groupdict())
            print(rec)

{'program': 'bash', 'pid': '2888', 'cpu': '002', 'irqs_disabled': '.', 'need_resched': '.', 'irq_context': '.', 'preempt_count': '.', 'timestamp': '214.858474', 'function': 'kmem_cache_free'}

In [55]:

line1 = '            bash-2888  [002] ....   214.858474: kmem_cache_free: call_site=c132e814 ptr=d78dd0a0\n'
line2 = '            bash-2833  [001] ....   214.858888: kmalloc: call_site=c13a0a0d ptr=d5265780 bytes_req=188 bytes_alloc=192 gfp_flags=GFP_KERNEL_ACCOUNT|__GFP_ZERO\n'

field_names = ("program", "pid", "cpu", 
               "irqs_disabled", "need_resched", "irq_context",
               "preempt_count", "timestamp", "function",
               "bytes_req", "bytes_alloc")

generic_regex = r"""
    (?P<program>\S+)
    -
    (?P<pid>\d+)
    \s+\[
    (?P<cpu>\d+)
    \]\s+
    (?P<irqs_disabled>.)
    (?P<need_resched>.)
    (?P<irq_context>.)
    (?P<preempt_count>.)
    \s+
    (?P<timestamp>[\d\.]+)
    :\s+
    (?P<function>\w+)
    :\s+.+
"""

alloc_regex = r"""
    bytes_req=(?P<bytes_req>\d+)
    \s+
    bytes_alloc=(?P<bytes_alloc>\d+)
"""


def log_to_csv(logfile, csvfile, fields, *regex):
    import re
    from collections import OrderedDict
    from csv import DictWriter
    patterns = [ re.compile(r, re.VERBOSE) for r in regex ]
    
    with open(logfile) as infile,\
         open(csvfile, "w") as outfile:
        
        csvout = DictWriter(outfile, fieldnames=fields)
        csvout.writeheader()
        
        for line in infile:
            rec = OrderedDict()
            for p in patterns:
                m = p.search(line)
                if m: 
                    rec.update(m.groupdict())
            if rec:
                csvout.writerow(rec)

In [56]:
log_to_csv("kmem-trace.log", "kmem-trace.csv", field_names, 
            generic_regex, alloc_regex)

In [57]:
%save log_to_csv.py 55

The following commands were written to file `log_to_csv.py`:

line1 = '            bash-2888  [002] ....   214.858474: kmem_cache_free: call_site=c132e814 ptr=d78dd0a0\n'
line2 = '            bash-2833  [001] ....   214.858888: kmalloc: call_site=c13a0a0d ptr=d5265780 bytes_req=188 bytes_alloc=192 gfp_flags=GFP_KERNEL_ACCOUNT|__GFP_ZERO\n'

field_names = ("program", "pid", "cpu",
               "irqs_disabled", "need_resched", "irq_context",
               "preempt_count", "timestamp", "function",
               "bytes_req", "bytes_alloc")

generic_regex = r"""
    (?P<program>\S+)
    -
    (?P<pid>\d+)
    \s+\[
    (?P<cpu>\d+)
    \]\s+
    (?P<irqs_disabled>.)
    (?P<need_resched>.)
    (?P<irq_context>.)
    (?P<preempt_count>.)
    \s+
    (?P<timestamp>[\d\.]+)
    :\s+
    (?P<function>\w+)
    :\s+.+
"""

alloc_regex = r"""
    bytes_req=(?P<bytes_req>\d+)
    \s+
    bytes_alloc=(?P<bytes_alloc>\d+)
"""


def log_to_csv(logfile, csvfile, fields, *regex):
    import re
    from collections import OrderedDict
    from csv import DictWriter
    patterns = [ re.compile(r, re.VERBOSE) for r in regex ]

    with open(logfile) as infile,\
         open(csvfile, "w") as outfile:

        csvout = DictWriter(outfile, fieldnames=fields)
        csvout.writeheader()

        for line in infile:
            rec = OrderedDict()
            for p in patterns:
                m = p.search(line)
                if m:
                    rec.update(m.groupdict())
            if rec:
                csvout.writerow(rec)

In [58]:
tf = pd.read_csv("kmem-trace.csv", chunksize=1024*25)

total_size = 0
for df in tf:
    total_size += df.bytes_alloc.sum()
    
print(total_size)

46668392.0

In [68]:
tf = pd.read_csv("kmem-trace.csv", chunksize=1024*25)

df = tf.get_chunk()

df.groupby("cpu").sum()["bytes_alloc"]

cpu
0    1064216.0
1    1159248.0
2     697752.0
3    1016096.0
Name: bytes_alloc, dtype: float64

In [70]:
tf = pd.read_csv("kmem-trace.csv", chunksize=1024*25)

bytes_alloc = {0: 0, 1: 0, 2: 0, 3: 0}
for df in tf:
    row = df.groupby("cpu").sum().bytes_alloc
    bytes_alloc[0] += row.get(0, 0)
    bytes_alloc[1] += row.get(1, 0)
    bytes_alloc[2] += row.get(2, 0)
    bytes_alloc[3] += row.get(3, 0)
    
print(bytes_alloc)

{0: 22065744.0, 1: 15694768.0, 2: 4239080.0, 3: 4668800.0}

In [101]:
# Find out on which CPU, most memory allocations occurred.
res = pd.concat(
         df.groupby("cpu").sum()[["bytes_alloc"]] \
         for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25)).groupby("cpu").sum()
res

     bytes_alloc
cpu
0     22065744.0
1     15694768.0
2      4239080.0
3      4668800.0

In [71]:
## Intermediate try-out
tf = pd.read_csv("kmem-trace.csv", chunksize=1024*25)

df = next(tf)

In [89]:
## Find number of times kmalloc was invoked on each CPU
df = next(tf)
df[df.function == "kmalloc"].groupby("cpu").count()[["function"]]

     function
cpu
0         134
1          68
2          56
3          82

In [88]:
## Find number of times kmalloc was invoked on each CPU
r1 = df[df.function == "kmalloc"].groupby("cpu").count()[["function"]]

In [90]:
## Find number of times kmalloc was invoked on each CPU
r2 = df[df.function == "kmalloc"].groupby("cpu").count()[["function"]]

In [99]:
# Find out on which CPU kmalloc was invoked the most!
res = pd.concat(
         df[df.function == "kmalloc"].groupby("cpu").count()[["function"]] \
         for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25)).groupby("cpu").sum()
res

     function
cpu
0        5871
1         652
2         375
3         198

In [109]:
# How often memory allocations were performed with interrupts disabled.

pd.concat(df[df["irqs_disabled"] == 'd'][["bytes_alloc"]].dropna() \
          for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25)).count()

bytes_alloc    811
dtype: int64

In [110]:
# Highest memory allocation in bytes
pd.concat(df[["bytes_alloc"]].dropna() \
          for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25)).max()

bytes_alloc    16384.0
dtype: float64

In [125]:
# Which process accounted for maximum memory allocation
result = pd.concat(df.groupby(["program"]).bytes_alloc.sum() \
          for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25))

result.groupby(["program"]).sum().sort_values(ascending=False)[:1]

program
top    18864120.0
Name: bytes_alloc, dtype: float64

In [148]:
# Check if kmallocs are lesser than kfrees
result = pd.concat(df.groupby("function").count() \
          for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25))

total_calls = result.groupby("function").sum()["program"]

In [149]:
total_calls.loc["kmalloc"] < total_calls.loc["kfree"]

True

In [150]:
tf = pd.read_csv("kmem-trace.csv", chunksize=1024*25)

In [151]:
df = next(tf)

In [161]:
# Total internal fragmentation of memory
pd.concat((df.bytes_alloc - df.bytes_req).dropna() \
          for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25)).sum()

263675.0

In [162]:
# Which process accounts for maxium preempt disable states

pd.concat(df[df.preempt_count != "."].groupby("program").count() \
          for df in pd.read_csv("kmem-trace.csv", chunksize=1024*25)).sum()

pid              51782
cpu              51782
irqs_disabled    51782
need_resched     51782
irq_context      51782
preempt_count    51782
timestamp        51782
function         51782
bytes_req          904
bytes_alloc        904
dtype: int64

In [157]:
df[]

,program,pid,cpu,irqs_disabled,need_resched,irq_context,preempt_count,timestamp,function,bytes_req,bytes_alloc
199,bash,2833,1,.,.,.,.,214.858891,kmalloc,384.0,512.0